#### creating a Data frame

In [5]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [7]:
cars={'brand':['honda','toyota','audi','ford'],
      'price':[22000,25000,27000,35000]
    }
df=pd.DataFrame(cars)
df.head()

    brand  price
0   honda  22000
1  toyota  25000
2    audi  27000
3    ford  35000

In [13]:
marklist={'name':['abhimanyu','ajith','akshay','alen','anand','ansal','arun','aswin','dhavood','haripriya','indrajith','jishnu','jishnuraj','jopika','keerthi','kiran','lubna','mancy','merlin','safeer','siraj','nandakrishnan','najmi','nida','rahul','ramshad','sanika','sanoy','shammas','smijith','sneha','soorya','swathi','vidya','vishnu'],
          'python':[24,25,24,25,25,25,24,24,24,24,25,25,23,24,25,24,24,25,24,24,24,0,25,25,25,25,25,24,24,24,22,24,25,23,24],
          'statistics':[15,15,18,18,16,19,15,13,16,17,13,15,15,13,16,20,16,16,16,15,19,0,13,15,16,19,17,15,17,13,13,16,16,17,17],
          'total':[39,40,42,43,41,44,39,37,40,41,38,40,38,37,41,44,40,41,40,39,43,0,38,40,41,44,42,39,41,37,35,40,41,40,41],
          'percentage':[86.67,88.89,93.33,95.56,91.11,97.78,86.67,82.22,88.89,91.11,84.44,88.89,84.44,82.22,91.11,97.78,88.89,91.11,88.89,86.67,95.56,0,84.44,88.89,91.11,97.78,93.33,86.67,91.11,82.22,77.78,88.89,91.11,88.89,91.11],
         }
df=pd.DataFrame(marklist)
df.head()

        name  python  statistics  total  percentage
0  abhimanyu      24          15     39       86.67
1      ajith      25          15     40       88.89
2     akshay      24          18     42       93.33
3       alen      25          18     43       95.56
4      anand      25          16     41       91.11

In [14]:
df['total'].max()

44

In [15]:
df['total'].min()

0

In [16]:
df['python'].max()

25

In [17]:
df['total'].mean()

39.02857142857143

In [19]:
df['total'].std()

7.106276075685883

In [20]:
df['python'].min()

0

In [21]:
df['python'].mean()

23.6

In [23]:
df[df['python']<15]

             name  python  statistics  total  percentage
21  nandakrishnan       0           0      0         0.0

In [27]:
df.set_index('python')

                 name  statistics  total  percentage
python
24          abhimanyu          15     39       86.67
25              ajith          15     40       88.89
24             akshay          18     42       93.33
25               alen          18     43       95.56
25              anand          16     41       91.11
25              ansal          19     44       97.78
24               arun          15     39       86.67
24              aswin          13     37       82.22
24            dhavood          16     40       88.89
24          haripriya          17     41       91.11
25          indrajith          13     38       84.44
25             jishnu          15     40       88.89
23          jishnuraj          15     38       84.44
24             jopika          13     37       82.22
25            keerthi          16     41       91.11
24              kiran          20     44       97.78
24              lubna          16     40       88.89
25              mancy          16     41       91.11
24             merlin          16     40       88.89
24             safeer          15     39       86.67
24              siraj          19     43       95.56
0       nandakrishnan           0      0        0.00
25              najmi          13     38       84.44
25               nida          15     40       88.89
25              rahul          16     41       91.11
25            ramshad          19     44       97.78
25             sanika          17     42       93.33
24              sanoy          15     39       86.67
24            shammas          17     41       91.11
24            smijith          13     37       82.22
22              sneha          13     35       77.78
24             soorya          16     40       88.89
25             swathi          16     41       91.11
23              vidya          17     40       88.89
24             vishnu          17     41       91.11

In [31]:
df.iloc[28]

name          shammas
python             24
statistics         17
total              41
percentage      91.11
Name: 28, dtype: object

In [34]:
df[df['percentage']==df['percentage'].max()]

       name  python  statistics  total  percentage
5     ansal      25          19     44       97.78
15    kiran      24          20     44       97.78
25  ramshad      25          19     44       97.78

# indexing

In [35]:
df.set_index('name',inplace=True)
df.head()

           python  statistics  total  percentage
name
abhimanyu      24          15     39       86.67
ajith          25          15     40       88.89
akshay         24          18     42       93.33
alen           25          18     43       95.56
anand          25          16     41       91.11

In [36]:
df.loc['swathi']

python        25.00
statistics    16.00
total         41.00
percentage    91.11
Name: swathi, dtype: float64

In [37]:
df.iloc[20]

python        24.00
statistics    19.00
total         43.00
percentage    95.56
Name: siraj, dtype: float64

In [3]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [4]:
import pandas as pd
data = {
    "calories":[420,380,650],
    "duration":[50,40,45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       650        45

In [6]:
print(df.loc[[0, 2]])

   calories  duration
0       420        50
2       650        45

In [7]:
df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       650        45